In [ ]:
#list of Highschool

high_school=["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

for school in high_school:
    print(school)

In [ ]:
# A dictonary of highschool and the type of school
high_school_type=[{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
#dictionary entries

for schooltype in high_school_type:
    print (schooltype)

In [ ]:
#add the following list of high school

high_schools=["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [ ]:
# Add the Pandas dependency.
import pandas as pd

In [15]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
print(school_series)

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [16]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [17]:
#three seprate list on informayyion of highschools

school_id=[0,1,2,3,4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [18]:
#initialize the new DataFrame

school_df = pd.DataFrame()

In [21]:
#add the list to a new DataFrame

school_df["School_Id"]= school_id
school_df["School_Name"]= school_name
school_df["type"] = type_of_school

#print the DataFrame
school_df

   School_Id            School_Name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [22]:
#another way,create a dictionary on information of highschool
high_school_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [25]:
#create dictionary as DataFrame

high_school_dict = pd.DataFrame()

#add list to DataFrame

high_school_dict["school_Id"]=school_id
high_school_dict["school_name"] = school_name
high_school_dict["type"]= type_of_school

#print DF

high_school_dict

   school_Id            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [28]:
school_df.columns
school_df.index
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [55]:

school_id= [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]
school_name=["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]
type_of_school=["District","District","Charter","District","Charter","Charter","charter","District","Charter","Charter","Charter","District","District","District","Charter"]

In [66]:
high_schools_df=pd.DataFrame
high_schools_df["School_Id"]= school_id
high_schools_df["School_Name"]= school_name
high_schools_df["type"] = type_of_school

high_schools_df

TypeError: 'type' object does not support item assignment

In [1]:
#how to find NaN(null value or number)in data set/use isnull()function
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df.isnull().sum()

AAPL    6
dtype: int64

In [4]:
#inserting null value manually and dropping them
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})
daily_returns
daily_returns.dropna()

   AAPL  GOOG
0  0.50  0.45
2  0.62  0.55

In [11]:
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})

# Replace the NaNs with "Unknown"
#daily_returns = daily_returns.fillna("Unknown")

# Replace the NaNs with 0
#daily_returns = daily_returns.fillna(0)

# Replace the NaNs with the mean of the column
daily_returns = daily_returns.fillna(daily_returns.mean())

daily_returns

   AAPL  GOOG
0  0.50  0.45
1  0.56  0.63
2  0.62  0.55

In [13]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df

best_actors_df.duplicated()
best_actors_df.duplicated().sum()

1

In [14]:
best_actors_df = best_actors_df.drop_duplicates()
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford

In [21]:
#seprate data
import pandas as pd

prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})
#replace $ sign with "" string
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")

prices
prices.dtypes

C:\Users\raman\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:8: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.

price_usd    object
dtype: object

In [22]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].astype("float")
prices

   price_usd
0       0.53
1       0.22
2       0.34

In [23]:
prices.dtypes

price_usd    float64
dtype: object

In [ ]:
#practice module 4.3.0

In [24]:
import pandas as pd
import os

In [25]:
student_data = os.path.join('resources/new_student_data.csv')
student_df = pd.read_csv(student_data)

In [26]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

In [27]:
#finding all null values
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1414
math_score        705
school_type         0
dtype: int64

In [31]:
#drop null data
student_df=student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
dtype: int64

In [35]:
#check for duplicate rows
student_df.duplicated().sum()

1299

In [39]:
#drop duplicates row
student_df=student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [51]:
#find the data type
student_df.dtype(['grade'])

TypeError: 'numpy.dtype[object_]' object is not callable

In [44]:
#find the perticular colom data type
student_df.loc['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

AttributeError: 'str' object has no attribute 'str'

In [45]:
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

AttributeError: 'str' object has no attribute 'astype'